hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/proprietary_rf/gzll/nrf_gzp_host.c
/**
    Copyright (c) 2009 - 2018, Nordic Semiconductor ASA

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification,
    are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
      list of conditions and the following disclaimer.

    2. Redistributions in binary form, except as embedded into a Nordic
      Semiconductor ASA integrated circuit in a product or a software update for
      such product, must reproduce the above copyright notice, this list of
      conditions and the following disclaimer in the documentation and/or other
      materials provided with the distribution.

    3. Neither the name of Nordic Semiconductor ASA nor the names of its
      contributors may be used to endorse or promote products derived from this
      software without specific prior written permission.

    4. This software, with or without modification, must only be used with a
      Nordic Semiconductor ASA integrated circuit.

    5. Any software provided in binary form under this license must not be reverse
      engineered, decompiled, modified and/or disassembled.

    THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
    OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
    OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
    LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
    CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
    GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
    HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
    LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
    OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*/
/**
    @file
    @brief Implementation of Gazell Pairing Library (gzp), Host functions.
    @defgroup gzp_source_host Gazell Pairing Host implementation
    @{
    @ingroup gzp_04_source
*/


#include "nrf_gzp.h"
#include "nrf_gzll.h"
#include <string.h>
#include <stdint.h>
#include <stdbool.h>
#include "nrf_assert.h"
#include "nrf_ecb.h"
#include "nrf_nvmc.h"


//lint -esym(40, GZP_PARAMS_STORAGE_ADR) "Undeclared identifier"
#define GZP_PARAMS_DB_ADR GZP_PARAMS_STORAGE_ADR    // Address of the GZP parameters flash page.


/******************************************************************************/
/** @name Typedefs
    @{ */
/******************************************************************************/

/**
    Definition of internal states.
*/
typedef enum
{
    GZP_ID_REQ_IDLE,                 ///< No Host ID request received from Device.
    GZP_ID_REQ_PENDING,              ///< Host ID request received and waiting on application to grant/reject.
    GZP_ID_REQ_PENDING_AND_GRANTED,  ///< Host ID request received and granted by application.
    GZP_ID_REQ_PENDING_AND_REJECTED, ///< Host ID request received and rejected by application.
} gzp_id_req_stat_t;

/** @} */


/******************************************************************************/
/** @name Internal (static) function prototypes
    @{ */
/******************************************************************************/


/**
    Function for incrementing internal session counter.
*/
static void gzp_session_counter_inc(void);


/**
    Function for reading value of internal session counter.
    @param dst   Current session counter.
*/
static void gzp_get_session_counter(uint8_t *dst);


/**
    Function processing received "system address request" from Device.

    @param gzp_req  Pointer to RX payload containing system address request.
*/
static void gzp_process_address_req(uint8_t *gzp_req);


/**
    Function to process Host ID request from device.

    The Host shall retrieve the Host ID from NVM, or shall generate if
    it does not yet exist.

    @param rx_payload Pointer to rx_payload contaning Host ID request.
*/
static void gzp_process_id_req(uint8_t *rx_payload);

/**
    Function to process Host ID fetch request from Device.

    The Device fetches the Host ID after the Host has generated/retrieved
    the Host ID.

    @param rx_payload Pointer to rx_payload contaning Host ID fetch request.
*/
static void gzp_process_id_fetch(uint8_t *rx_payload);


/**
    Function to process Key Update Prepare packet.

    Device requests the Session Token to be used for the Key Update request.
*/
static void gzp_process_key_update_prepare(void);


/**
    Function to process Key Update packet.

    Device requests a Key Update and sends a new Dynamic Key. The Dynamic Key is
    updated on the Host.

    @param rx_payload Pointer to rx_payload containing Key Update request.
*/
static void gzp_process_key_update(uint8_t *rx_payload);


/**
    Function to process received Encrypted User packet.

    @param rx_payload Pointer to rx_payload containing the encrypted user data.
    @param length     Length of encrypted user data.
*/
static void gzp_process_encrypted_user_data(uint8_t *rx_payload, uint8_t length);


/**
    Function to preload the payload for the next ACK.

    @param src       Pointer to source payload.
    @param length    Length of source payload.
    @param pipe      Pipe for the ACK payload.
*/
static void gzp_preload_ack(uint8_t *src, uint8_t length, uint8_t pipe);


/**
    Function for reading the Chip ID from non-volatile memory.

    The chip ID is used for the system address.

    If the Chip ID is not yet created a random Chip ID is created and
    written to non-volatile memory. Note that the term chip ID is used as
    the factory programmed chip sequence number was used for the system
    address in nRF24LU ICs.

    @param     dst  Address to copy Host ID to.
    @param[in] n    Number of bytes in the Host ID.
*/
void gzp_host_chip_id_read(uint8_t *dst, uint8_t n);


/**
    Function to set the Host ID.

    Writes the Host ID to non-volatile memory.
    @param src   Address of the Host ID to copy from.
*/
static void gzp_set_host_id(const uint8_t *src);


/**
    Function to request disabling of Gazell and wait for it to be disabled.

    Emulates legacy gzll_goto_idle().
*/
static void gzll_goto_idle(void);


/**
    Flush all TX FIFOs.

    Emulates legacy gzll_tx_fifo_flush().
*/
static void gzll_tx_fifo_flush(void);


/**
    Flush all RX FIFOs.

    Emulates legacy gzll_rx_fifo_flush().
*/
static void gzll_rx_fifo_flush(void);


/**
    Set a timeout for the reception of packets on the Gazell Host.

    Emulates legacy Gazell function: gzll_set_param(GZLL_PARAM_RX_TIMEOUT, x).

