hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/proprietary_rf/gzll/nrf_gzp_host.c
    @param timeout   Timeout in number of legacy "RX periods"
                   (1 RX period = 2 timeslot periods).
*/
static void gzll_set_rx_timeout(uint32_t timeout);

/** @} */


/******************************************************************************/
/** @name Internal (static) variabls
    @{ */
/******************************************************************************/

static gzp_id_req_stat_t gzp_id_req_stat; ///< Current state of Host ID request.
static bool gzp_pairing_enabled_f;        ///< True if Host is paired with a device.
static bool gzp_address_exchanged_f;      ///< True if Host has exchanged a system address with a device and thus pairing has begun.

static uint8_t gzp_session_counter[GZP_SESSION_TOKEN_LENGTH]; ///< Session counter used for key generation and update.

static bool gzp_encrypted_user_data[GZP_ENCRYPTED_USER_DATA_MAX_LENGTH]; ///< Placeholder for encrypted data from Device.
static uint8_t gzp_encrypted_user_data_length;                           ///< Length of gzp_encrypted_user_data. Zero implies no data received.

static nrf_gzll_host_rx_info_t prev_gzp_rx_info = {0, 0};                ///< RSSI and status of ACK payload transmission of previous Gazell packet.

// Define Macro to make array initialization nicer
#define REP4(X) X X X X

#if defined(__ICCARM__)
    #if GZP_PARAMS_DB_ADR == 0x1000
        static const uint32_t database[GZP_DEVICE_PARAMS_STORAGE_SIZE / 4] @ "gzp_dev_data"
    #elif GZP_PARAMS_DB_ADR == 0x15000
        static const uint32_t database[GZP_DEVICE_PARAMS_STORAGE_SIZE / 4] @ "gzp_dev_data_sd"
    #else
        #error
    #endif
#else
    static const uint32_t database[GZP_DEVICE_PARAMS_STORAGE_SIZE / 4] __attribute__((at(GZP_PARAMS_DB_ADR)))
#endif
=
{
#define STATIC_INIT_VALUE    0xFFFFFFFF
#define STATIC_INIT_COUNT    (GZP_DEVICE_PARAMS_STORAGE_SIZE / 4)
#define INIT_1 STATIC_INIT_VALUE,
#define INIT_4 REP4(INIT_1)
#define INIT_16 REP4(INIT_4)
#define INIT_64 REP4(INIT_16)
#define INIT_256 REP4(INIT_64)
#define INIT_1024 REP4(INIT_256)

    #if (STATIC_INIT_COUNT == 256)
    INIT_256
    #elif (STATIC_INIT_COUNT == 1024)
    INIT_1024
    #else
#error Gazell Pairing Library database not initialized properly!
    #endif
}; ///< Database for storing keys.

/** @} */


/******************************************************************************/
// Implementation: Host-specific API functions
/******************************************************************************/

void gzp_init()
{
    uint8_t system_address[GZP_SYSTEM_ADDRESS_WIDTH];
    
    // Read "chip id", of which 4 bytes (GZP_SYSTEM_ADDRESS_WIDTH)
    // are used as system address
    gzp_host_chip_id_read(system_address, GZP_SYSTEM_ADDRESS_WIDTH);
    
    // Set up radio parameters (addresses and channel subset) from system_address
    (void)gzp_update_radio_params(system_address);
    
    // Only "data pipe" enabled by default
    
    (void)nrf_gzll_set_rx_pipes_enabled(nrf_gzll_get_rx_pipes_enabled() | (1 << GZP_DATA_PIPE));
    
    gzp_pairing_enabled_f = false;
    gzp_address_exchanged_f = false;
    gzp_id_req_stat = GZP_ID_REQ_IDLE;
    gzp_encrypted_user_data_length = 0;
    
    // Infinite RX timeout
    gzll_set_rx_timeout(0);
}

void gzp_pairing_enable(bool enable)
{
    if(gzp_pairing_enabled_f != enable)
    {
        gzll_goto_idle();
        
        if(enable)
            (void)nrf_gzll_set_rx_pipes_enabled(nrf_gzll_get_rx_pipes_enabled() | (1 << GZP_PAIRING_PIPE));
            
        else
        {
            (void)nrf_gzll_set_rx_pipes_enabled(nrf_gzll_get_rx_pipes_enabled() & ~(1 << GZP_PAIRING_PIPE));
            
            gzp_id_req_stat = GZP_ID_REQ_IDLE;
        }
        
        gzp_pairing_enabled_f = enable;
        
        gzll_rx_start();
    }
}

void gzp_host_execute()
{
    bool gzp_packet_received = false;
    uint32_t payload_length = NRF_GZLL_CONST_MAX_PAYLOAD_LENGTH;
    uint8_t rx_payload[NRF_GZLL_CONST_MAX_PAYLOAD_LENGTH];
    
    gzp_address_exchanged_f = false;
    
    if(nrf_gzll_get_rx_fifo_packet_count(GZP_PAIRING_PIPE) > 0)
        gzp_packet_received = nrf_gzll_fetch_packet_from_rx_fifo(GZP_PAIRING_PIPE, rx_payload, &payload_length);
        
    if(!gzp_packet_received && (gzp_encrypted_user_data_length == 0))
    {
        if(nrf_gzll_get_rx_fifo_packet_count(GZP_DATA_PIPE) > 0)
            gzp_packet_received = nrf_gzll_fetch_packet_from_rx_fifo(GZP_DATA_PIPE, rx_payload, &payload_length);
    }
    
    if(gzp_packet_received)
    {
        //lint -save -esym(644,rx_payload) //may not have been initialized
        switch(rx_payload[0])
        {
            case GZP_CMD_HOST_ADDRESS_REQ:
                gzp_process_address_req(rx_payload);
                break;
                
                #ifndef GZP_CRYPT_DISABLE
                
            case GZP_CMD_HOST_ID_REQ:
                gzp_process_id_req(rx_payload);
                break;
                
            case GZP_CMD_HOST_ID_FETCH:
                gzp_process_id_fetch(rx_payload);
                break;
                
            case GZP_CMD_KEY_UPDATE_PREPARE:
                gzp_process_key_update_prepare();
                break;
                
            case GZP_CMD_KEY_UPDATE:
                gzp_process_key_update(rx_payload);
                break;
                
            case GZP_CMD_ENCRYPTED_USER_DATA:
                gzp_process_encrypted_user_data(rx_payload, payload_length);
                break;
                
                #endif
                
            case GZP_CMD_FETCH_RESP:
            default:
                break;
        }
    }
    
    // Restart reception if "not proximity backoff" period has elapsed
    if(!nrf_gzll_is_enabled())
    {
        gzll_set_rx_timeout(0);
        
        if(gzp_pairing_enabled_f)
            (void)nrf_gzll_set_rx_pipes_enabled(nrf_gzll_get_rx_pipes_enabled() | (1 << GZP_PAIRING_PIPE));
            
        gzll_rx_start();
    }
    
    #ifndef GZP_CRYPT_DISABLE
    gzp_session_counter_inc();
    #endif
}

void gzll_rx_start(void)
{
    if(nrf_gzll_get_mode() != NRF_GZLL_MODE_HOST)
    {
        gzll_goto_idle();
        (void)nrf_gzll_set_mode(NRF_GZLL_MODE_HOST);
    }
    
    if(!nrf_gzll_is_enabled())
        (void)nrf_gzll_enable();
}

bool gzp_id_req_received()
{
    return (gzp_id_req_stat != GZP_ID_REQ_IDLE);
}

void gzp_id_req_reject()
{
    if(gzp_id_req_received())
        gzp_id_req_stat = GZP_ID_REQ_PENDING_AND_REJECTED;
}

void gzp_id_req_grant()
{
    if(gzp_id_req_received())
        gzp_id_req_stat = GZP_ID_REQ_PENDING_AND_GRANTED;
}

void gzp_id_req_cancel()
{
    if(gzp_id_req_received())
        gzp_id_req_stat = GZP_ID_REQ_IDLE;
}

