hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/proprietary_rf/gzll/nrf_gzp_host.c
//-----------------------------------------------------------------------------
// Implementation: Static functions
//-----------------------------------------------------------------------------

static void gzp_process_address_req(uint8_t *gzp_req)
{
    uint8_t temp_rx_pipes;
    uint8_t pairing_resp[GZP_CMD_HOST_ADDRESS_RESP_PAYLOAD_LENGTH];
    uint32_t rx_payload_length = NRF_GZLL_CONST_MAX_PAYLOAD_LENGTH;
    
    gzp_address_exchanged_f = false;
    
    gzll_goto_idle();
    ASSERT(nrf_gzll_get_error_code() == NRF_GZLL_ERROR_CODE_NO_ERROR);
    
    temp_rx_pipes = nrf_gzll_get_rx_pipes_enabled();
    ASSERT(nrf_gzll_get_error_code() == NRF_GZLL_ERROR_CODE_NO_ERROR);
    
    // If requesting Device within close proximity
    if(prev_gzp_rx_info.rssi >= GZP_HOST_RX_POWER_THRESHOLD)
    {
        (void)nrf_gzll_set_rx_pipes_enabled(0);
        ASSERT(nrf_gzll_get_error_code() == NRF_GZLL_ERROR_CODE_NO_ERROR);
        
        gzll_set_rx_timeout(GZP_CLOSE_PROXIMITY_BACKOFF_RX_TIMEOUT);
        ASSERT(nrf_gzll_get_error_code() == NRF_GZLL_ERROR_CODE_NO_ERROR);
        
        gzll_rx_fifo_flush();
        ASSERT(nrf_gzll_get_error_code() == NRF_GZLL_ERROR_CODE_NO_ERROR);
        
        // Start "proximity" back off period
        gzll_rx_start();
        ASSERT(nrf_gzll_get_error_code() == NRF_GZLL_ERROR_CODE_NO_ERROR);
        
        while(nrf_gzll_is_enabled())
        {}
        
        // Build pairing response packet
        pairing_resp[0] = (uint8_t)GZP_CMD_HOST_ADDRESS_RESP;
        gzp_host_chip_id_read(&pairing_resp[GZP_CMD_HOST_ADDRESS_RESP_ADDRESS], GZP_SYSTEM_ADDRESS_WIDTH);
        
        (void)nrf_gzll_add_packet_to_tx_fifo(0, &pairing_resp[0], GZP_CMD_HOST_ADDRESS_RESP_PAYLOAD_LENGTH);
        ASSERT(nrf_gzll_get_error_code() == NRF_GZLL_ERROR_CODE_NO_ERROR);
        gzll_set_rx_timeout(GZP_STEP1_RX_TIMEOUT);
        
        // Enable only pairing pipe when waiting for pairing request step 1
        (void)nrf_gzll_set_rx_pipes_enabled((1 << GZP_PAIRING_PIPE));
        
        gzll_rx_start();
        
        while(nrf_gzll_is_enabled())
        {
            if(nrf_gzll_get_rx_fifo_packet_count(GZP_PAIRING_PIPE))
            {
                (void)nrf_gzll_fetch_packet_from_rx_fifo(GZP_PAIRING_PIPE, &gzp_req[0], &rx_payload_length);
                
                // Validate step 1 of pairing request
                if(gzp_req[0] == (uint8_t)GZP_CMD_HOST_ADDRESS_FETCH)
                    gzp_address_exchanged_f = true;
            }
        }
        
        gzll_tx_fifo_flush();
        gzll_rx_fifo_flush();
        
        gzll_set_rx_timeout(0);
        
        (void)nrf_gzll_set_rx_pipes_enabled(temp_rx_pipes);
        
        // Return to normal operation
        gzll_rx_start();
    }
    
    else
    {
        (void)nrf_gzll_set_rx_pipes_enabled(temp_rx_pipes & ~(1 << GZP_PAIRING_PIPE));
        
        gzll_set_rx_timeout(GZP_NOT_PROXIMITY_BACKOFF_RX_TIMEOUT);
        
        // Start "not proximity" backoff period
        gzll_rx_start();
    }
}

static void gzp_preload_ack(uint8_t *src, uint8_t length, uint8_t pipe)
{
    gzll_goto_idle();
    
    gzll_tx_fifo_flush();
    
    (void)nrf_gzll_add_packet_to_tx_fifo(pipe, src, length);
    
    gzll_rx_start();
}

static void gzll_set_rx_timeout(uint32_t timeout)
{
    timeout *= 2; // * 2 as gzll_set_rx_timeout() takes RX_PERIODS as input, which equals 2 timeslots.
    nrf_gzll_set_auto_disable(timeout);
}

bool gzp_address_exchanged()
{
    return gzp_address_exchanged_f;
}

#ifndef GZP_CRYPT_DISABLE

bool gzp_crypt_user_data_received()
{
    return (gzp_encrypted_user_data_length > 0);
}

bool gzp_crypt_user_data_read(uint8_t *dst, uint8_t *length)
{
    if(gzp_encrypted_user_data_length > 0)
    {
        memcpy(dst, (void *)gzp_encrypted_user_data, gzp_encrypted_user_data_length);
        
        if(length != NULL)
            *length = gzp_encrypted_user_data_length;
            
        gzp_encrypted_user_data_length = 0;
        
        return true;
    }
    
    else
        return false;
}

static void gzp_session_counter_inc()
{
    uint8_t i;
    
    for(i = 0; i < GZP_SESSION_TOKEN_LENGTH; i++)
    {
        gzp_session_counter[i]++;
        
        if(gzp_session_counter[i] != 0)
            break;
    }
}

static void gzp_get_session_counter(uint8_t *dst)
{
    memcpy(dst, (void *)gzp_session_counter, GZP_SESSION_TOKEN_LENGTH);
}

static void gzp_set_host_id(const uint8_t *src)
{
    if(*((uint8_t *)database) == 0xff)
    {
        nrf_nvmc_write_bytes(GZP_PARAMS_STORAGE_ADR + 1, src, GZP_HOST_ID_LENGTH);
        nrf_nvmc_write_byte(GZP_PARAMS_STORAGE_ADR, 0x00);
    }
}

void gzp_get_host_id(uint8_t *dst)
{
    memcpy(dst, (uint8_t *)GZP_PARAMS_STORAGE_ADR + 1, GZP_HOST_ID_LENGTH);
}

static void gzp_process_id_req(uint8_t *rx_payload)
{
    int i;
    uint8_t temp_host_id[GZP_HOST_ID_LENGTH];
    
    if(gzp_pairing_enabled_f)
    {
        if(!gzp_id_req_received())
        {
            gzp_crypt_set_session_token(&rx_payload[GZP_CMD_HOST_ID_REQ_SESSION_TOKEN]);
            gzp_id_req_stat = GZP_ID_REQ_PENDING;
        }
        
        gzp_get_host_id(temp_host_id);
        
        // Added:
        for(i = 0; i < GZP_HOST_ID_LENGTH; i++)
        {
            if(temp_host_id[i] != 0xFF)
                break;
        }
        
        if(i == GZP_HOST_ID_LENGTH)  // If host not generated yet
        {
            gzp_get_session_counter(temp_host_id);
            
            #if (GZP_HOST_ID_LENGTH > GZP_SESSION_TOKEN_LENGTH)
            gzp_xor_cipher(temp_host_id, temp_host_id, &rx_payload[GZP_CMD_HOST_ID_REQ_SESSION_TOKEN], GZP_SESSION_TOKEN_LENGTH);
            #else //(GZP_HOST_ID_LENGTH > GZP_SESSION_TOKEN_LENGTH)
            gzp_xor_cipher(temp_host_id, temp_host_id, &rx_payload[GZP_CMD_HOST_ID_REQ_SESSION_TOKEN], GZP_HOST_ID_LENGTH);
            #endif //(GZP_HOST_ID_LENGTH > GZP_SESSION_TOKEN_LENGTH)
            
            gzp_set_host_id(temp_host_id);
        }
    }
}

static void gzp_process_id_fetch(uint8_t *rx_payload)
{
    uint8_t tx_payload[GZP_CMD_HOST_ID_FETCH_RESP_PAYLOAD_LENGTH];
    
    if(gzp_id_req_received())
    {
        gzp_crypt_select_key(GZP_ID_EXCHANGE);
        gzp_crypt(&rx_payload[1], &rx_payload[1], GZP_CMD_HOST_ID_FETCH_PAYLOAD_LENGTH - 1);
        
        if(gzp_validate_id(&rx_payload[GZP_CMD_HOST_ID_FETCH_VALIDATION_ID]))
        {
            switch(gzp_id_req_stat)
            {
                case GZP_ID_REQ_PENDING_AND_GRANTED:
                    tx_payload[GZP_CMD_HOST_ID_FETCH_RESP_STATUS] = (uint8_t)GZP_ID_RESP_GRANTED;
                    gzp_get_host_id(&tx_payload[GZP_CMD_HOST_ID_FETCH_RESP_HOST_ID]);
                    gzp_id_req_stat = GZP_ID_REQ_IDLE;
                    break;
                    
                case GZP_ID_REQ_PENDING_AND_REJECTED:
                    tx_payload[GZP_CMD_HOST_ID_FETCH_RESP_STATUS] = (uint8_t)GZP_ID_RESP_REJECTED;
                    gzp_id_req_stat = GZP_ID_REQ_IDLE;
                    break;
                    
                case GZP_ID_REQ_PENDING:
                default:
                    tx_payload[GZP_CMD_HOST_ID_FETCH_RESP_STATUS] = (uint8_t)GZP_ID_RESP_PENDING;
                    break;
            }
            
            tx_payload[0] = (uint8_t)GZP_CMD_HOST_ID_FETCH_RESP;
            gzp_add_validation_id(&tx_payload[GZP_CMD_HOST_ID_FETCH_RESP_VALIDATION_ID]);
            gzp_crypt(&tx_payload[1], &tx_payload[1], GZP_CMD_HOST_ID_FETCH_RESP_PAYLOAD_LENGTH - 1);
            
